Repository: RedTurtle/collective.mass_subscriptions
Catalog: collective/mass_subscriptions/locales/*/LC_MESSAGES/collective.mass_subscriptions.po
Languages: it

source: CSV source file
it: File CSV

source: Mail message
it: Messaggio e-mail

source: Mail subject
it: Oggetto

source: Mass subscriptions of users
it: Iscrizione in massa di utenti

source: Notifications
it: Notifiche

source: Send
it: Invia

source: To send confirmation e-mail to users you need to provide both subject and a template
it: Per inviare l'e-mail di conferma devi fornire sia l'oggetto che un messaggio

source: Users data
it: Dati utenti

source: Users mass subscriptions
it: Iscrizioni in blocco di utenti

source: Warn subscribed users with an e-mail
it: Avverti gli utenti iscritti con una e-mail

source: cant_send_mail_message
it: Non posso inviare una e-mail a $username

source: csv_format_help
it: Fornisci un file CSV appropriato nel formato "username,fullname,email,password,…". Da notare che solo la colonna "username" è richiesta. Se non fornisci una "email" per un utente non potrai notificarlo con un messaggio. Se non fornisci una password questa verrà generata casualmente. Puoi inserire nel CSV tutte le proprietà che desideri; tutte queste verranno usate per aggiornare i dati utente. Il file CSV deve contenere una riga di intestazioni poiché il significato della colonna è preso dall'intestazione e non dalla posizione; devi essere certo che le intestazioni contengano i veri nomi delle proprietà.

source: mail_message_help
it: Seleziona per inviare una e-mail ad ogni nuovo utente con un messaggio personale.

source: mail_template_help
it: Scrivi un modello di messaggio che vorresti inviare. Puoi inserire nel messaggio "$username" per usare il nuovo nome utente, "$password" per usare la nuova password, "$portal_url" per usare l'URL corrente del sito. Puoi anche usare "$data-propname" per inserire nel messaggio una qualunque proprietà presa da una colonna del CSV dal nome "propname".

source: mass_subscription_form_description
it: Da questo modulo puoi fornire un file CSV con utenti che vuoi iscrivere al sito. Puoi anche fornire loro un messaggio di benvenuto che verrà loro inviato per e-mail, oppure aggiungerli immediatamente ad un gruppo.

source: new_user_error
it: Non posso iscrivere $name - $msg

source: new_user_message
it: Registrato un nuovo utente $name

source: send_mail_error_message
it: Errore nell'inviare la mail a $email
